<img src="images/usm.jpg" width="480" height="240" align="left"/>

# MAT281 - Laboratorio N°03

## Objetivos de la clase

* Reforzar los conceptos básicos de pandas.

## Contenidos

* [Problema 01](#p1)

## Problema 01


<img src="https://imagenes.universia.net/gc/net/images/practicas-empleo/p/pr/pro/profesiones-con-el-avance-de-la-tecnologia.jpg" width="480" height="360" align="center"/>


EL conjunto de datos se denomina `ocupation.csv`, el cual contiene información tal como: edad ,sexo, profesión, etc.

Lo primero es cargar el conjunto de datos y ver las primeras filas que lo componen:

In [3]:
import pandas as pd
import os

In [4]:
# cargar datos
df = pd.read_csv(os.path.join("data","ocupation.csv"), sep="|").set_index('user_id')
df.head()

         age gender  occupation zip_code
user_id
1         24      M  technician    85711
2         53      F       other    94043
3         23      M      writer    32067
4         24      M  technician    43537
5         33      F       other    15213

El objetivo es tratar de obtener la mayor información posible de este conjunto de datos. Para cumplir este objetivo debe resolver las siguientes problemáticas:

1. ¿Cuál es el número de observaciones en el conjunto de datos?

In [8]:
# Primero, ocuparemos el largo del datafram para obtener la cantidad de observaciones
o=1
for i in range(len(df.shape)):
    o = o*df.shape[i] #por cada observación que tengamos, deberemos sumar una a su posición relativa al dataframe.
print("El Número de Observaciones será:")
print(o)

El Número de Observaciones será:
3772

2. ¿Cuál es el número de columnas en el conjunto de datos?

In [5]:
print("El número de Columnas del Dataframe es:")
print(len(df.columns))

El número de Columnas del Dataframe es:
4

3. Imprime el nombre de todas las columnas

In [7]:
print("El nombre de las columnas será:")
print(df.columns)

El nombre de las columnas será:
Index(['age', 'gender', 'occupation', 'zip_code'], dtype='object')

4. Imprima el índice del dataframe

In [34]:
print("Los índices de las columnas serán:")
print(str(df.index))

Los índices de las columnas serán:
Int64Index([  1,   2,   3,   4,   5,   6,   7,   8,   9,  10,
            ...
            934, 935, 936, 937, 938, 939, 940, 941, 942, 943],
           dtype='int64', name='user_id', length=943)

5. ¿Cuál es el tipo de datos de cada columna?

In [11]:
print("El tipo de data de las columnas es:")
player_data = pd.read_csv(os.path.join('data', 'player_data.csv'), index_col='name')
type(player_data)
player_data.dtypes

El tipo de data de las columnas es:

year_start      int64
year_end        int64
position       object
height         object
weight        float64
birth_date     object
college        object
dtype: object

6. Resumir el conjunto de datos

In [36]:
df.describe()

              age
count  943.000000
mean    34.051962
std     12.192740
min      7.000000
25%     25.000000
50%     31.000000
75%     43.000000
max     73.000000

7. Resume conjunto de datos  con todas las columnas

In [32]:
df.describe(include='all')

               age gender occupation zip_code
count   943.000000    943        943      943
unique         NaN      2         21      795
top            NaN      M    student    55414
freq           NaN    670        196        9
mean     34.051962    NaN        NaN      NaN
std      12.192740    NaN        NaN      NaN
min       7.000000    NaN        NaN      NaN
25%      25.000000    NaN        NaN      NaN
50%      31.000000    NaN        NaN      NaN
75%      43.000000    NaN        NaN      NaN
max      73.000000    NaN        NaN      NaN

8. Imprimir solo la columna de **occupation**.

In [18]:
df.describe(include='all')[["occupation"]]

       occupation
count         943
unique         21
top       student
freq          196
mean          NaN
std           NaN
min           NaN
25%           NaN
50%           NaN
75%           NaN
max           NaN

9. ¿Cuántas ocupaciones diferentes hay en este conjunto de datos?

In [19]:
df.describe(include='all')[['occupation']].loc["unique"].to_frame()

           unique
occupation     21

10. ¿Cuál es la ocupación más frecuente?

In [20]:
df.describe(include='all')[['occupation']].loc["top"].to_frame()

                top
occupation  student

11. ¿Cuál es la edad media de los usuarios?

In [21]:
df.describe(include='all')[['occupation']].loc["mean"].to_frame()

           mean
occupation  NaN

12. ¿Cuál es la edad con menos ocurrencia?

In [29]:
se= df['age'].value_counts() #Creamos nuestra serie
m = se.min() #Obtenemos nuestro mínimo
mask = (se==m) #Obtenemos las mínimas recurrencias
se[mask].to_frame()

    age
11    1
10    1
73    1
66    1
7     1